# DBeam_SetShowAtPoint

```pascal
PROCEDURE DBeam_SetShowAtPoint(showFlag : INTEGER);
```

```python
def vs.DBeam_SetShowAtPoint(showFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|showFlag|INTEGER|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight